<?php

return [

    // 都道府県
    'prefectures' => [
        '1' => '北海道',
        '2' => '青森県',
        '3' => '岩手県',
        '4' => '宮城県',
        '5' => '秋田県',
        '6' => '山形県',
        '7' => '福島県',
        '8' => '茨城県',
        '9' => '栃木県',
        '10' => '群馬県',
        '11' => '埼玉県',
        '12' => '千葉県',
        '13' => '東京都',
        '14' => '神奈川県',
        '15' => '新潟県',
        '16' => '富山県',
        '17' => '石川県',
        '18' => '福井県',
        '19' => '山梨県',
        '20' => '長野県',
        '21' => '岐阜県',
        '22' => '静岡県',
        '23' => '愛知県',
        '24' => '三重県',
        '25' => '滋賀県',
        '26' => '京都府',
        '27' => '大阪府',
        '28' => '兵庫県',
        '29' => '奈良県',
        '30' => '和歌山県',
        '31' => '鳥取県',
        '32' => '島根県',
        '33' => '岡山県',
        '34' => '広島県',
        '35' => '山口県',
        '36' => '徳島県',
        '37' => '香川県',
        '38' => '愛媛県',
        '39' => '高知県',
        '40' => '福岡県',
        '41' => '佐賀県',
        '42' => '長崎県',
        '43' => '熊本県',
        '44' => '大分県',
        '45' => '宮崎県',
        '46' => '鹿児島県',
        '47' => '沖縄県',
        '99' => '海外'
    ],

    'charmpoints' => [
				'1' => '正社員経験なしOK',
				'2' => '既卒・第二新卒歓迎',
				'3' => 'マネージャー・管理職採用',
				'4' => '上場企業',
				'5' => '官公庁・学校関連',
				'6' => 'ベンチャー企業',
				'7' => '外資系企業',
				'8' => '株式公開準備中',
				'9' => '設立30年以上',
				'10' => '女性管理職登録実績あり',
				'11' => '英語・外国語を使う仕事あり',
				'12' => '新規事業',
				'13' => '在宅勤務可',
				'14' => '車通勤OK',
				'15' => '転勤なし',
				'16' => '服装自由',
				'17' => '社員寮あり',
				'18' => '年間休日120日以上',
				'19' => '完全土日祝日休み',
				'20' => '残業なし',
				'21' => '残業時間20時間以内',
				'22' => '週2〜3日からOK',
				'23' => '10時以降に始業',
				'24' => '夜勤・深夜・早朝（22時〜7時）',
				'25' => '副業・WワークOK'
    ],

    // 年間採用人数
    'annual_recruit_numbers' => [
        1 => '～10人',
        2 => '11～50人',
        3 => '51～100人',
        4 => '101～1000人',
        5 => '1001～10000人',
        6 => '10001人以上'
    ],

    // 従業員数
    'employee_numbers' => [
        1 => '1～9人',
        2 => '10～49人',
        3 => '50～99人',
        4 => '100～999人',
        5 => '1000人～'
    ],

    // ご検討状況
    'consideration_statuses' => [
        1 => '近々導入したい',
        2 => '興味があり検討したい',
        3 => 'まずは話を聞きたい',
        4 => 'とりあえず資料を見たい'
    ],

    // 会社ステータス
    'company_statuses' => [
        1 => '問い合わせ求人企業',
        2 => '承認待ち求人企業',
        3 => '求人企業',
        4 => '承認不可求人企業',
        5 => '退会',
        6 => '強制アカウント停止'
    ],

    // 運営企業・権限
    'admin_roles' => [
        1 => 'スタッフ',
        2 => '管理者'
    ],

    // 会社問い合わせタイプ
    'company_contact_types' => [
        1 => 'お問い合わせ',
        2 => '資料請求（無料）'
    ],

    // メールアドレス
    'emails' => [
        'admin' => 'admin@incul-agent.jp'
    ],

    // ユーザータイプ
    'user_types' => [
        1 => '求人企業',
        2 => '人材紹介',
        3 => '業務委託SES',
        4 => '運営企業',
    ]
];
