<?php

return [

    // 都道府県
    'prefectures' => [
        '1' => '北海道',
        '2' => '青森県',
        '3' => '岩手県',
        '4' => '宮城県',
        '5' => '秋田県',
        '6' => '山形県',
        '7' => '福島県',
        '8' => '茨城県',
        '9' => '栃木県',
        '10' => '群馬県',
        '11' => '埼玉県',
        '12' => '千葉県',
        '13' => '東京都',
        '14' => '神奈川県',
        '15' => '新潟県',
        '16' => '富山県',
        '17' => '石川県',
        '18' => '福井県',
        '19' => '山梨県',
        '20' => '長野県',
        '21' => '岐阜県',
        '22' => '静岡県',
        '23' => '愛知県',
        '24' => '三重県',
        '25' => '滋賀県',
        '26' => '京都府',
        '27' => '大阪府',
        '28' => '兵庫県',
        '29' => '奈良県',
        '30' => '和歌山県',
        '31' => '鳥取県',
        '32' => '島根県',
        '33' => '岡山県',
        '34' => '広島県',
        '35' => '山口県',
        '36' => '徳島県',
        '37' => '香川県',
        '38' => '愛媛県',
        '39' => '高知県',
        '40' => '福岡県',
        '41' => '佐賀県',
        '42' => '長崎県',
        '43' => '熊本県',
        '44' => '大分県',
        '45' => '宮崎県',
        '46' => '鹿児島県',
        '47' => '沖縄県',
        '99' => '海外'
    ],

    'charmpoints' => [
        '1' => '正社員経験なしOK',
        '2' => '既卒・第二新卒歓迎',
        '3' => 'マネージャー・管理職採用',
        '4' => '上場企業',
        '5' => '官公庁・学校関連',
        '6' => 'ベンチャー企業',
        '7' => '外資系企業',
        '8' => '株式公開準備中',
        '9' => '設立30年以上',
        '10' => '女性管理職登録実績あり',
        '11' => '英語・外国語を使う仕事あり',
        '12' => '新規事業',
        '13' => '在宅勤務可',
        '14' => '車通勤OK',
        '15' => '転勤なし',
        '16' => '服装自由',
        '17' => '社員寮あり',
        '18' => '年間休日120日以上',
        '19' => '完全土日祝日休み',
        '20' => '残業なし',
        '21' => '残業時間20時間以内',
        '22' => '週2〜3日からOK',
        '23' => '10時以降に始業',
        '24' => '夜勤・深夜・早朝（22時〜7時）',
        '25' => '副業・WワークOK'
    ],

    //スキル大項目
    'first_skill_category' => [
      '1' => '技術系（システム・ネットワーク）',
      '2' => 'クリエイティブ系（Web・ゲーム）',
      '3' => '営業系',
      '4' => '経理・会計・財務・税務系',
      '5' => '人事・総務・労務・広報・IR系',
      '6' => '法務・特許・コンプライアンス系'
    ],

    //スキル中項目
    'second_skill_category' => [
      '1' => [
            '1' => 'OS',
            '2' => 'プログラミング・言語',
            '3' => 'データベース・グループウェア',
            '4' => '経験分野（システム開発）',
            '5' => 'アプリケーションフレームワーク',
            '6' => 'インフラストラクチャ',
            '7' => 'データ分析'
      ],

      '2' => [
            '8' => 'ソフトウェア',
            '9' => '経験業務',
            '10' => 'アニメーションツール',
            '11' => '3Dモデリング',
            '12' => '3Dエフェクト'
      ],

      '3' => [
            '13' => '経験業務'
      ],

      '4' => [
            '14' => '企画・マーケティング',
            '15' => '事業戦略・推進',
            '16' => '経理・会計',
            '17' => '財務・税務'
      ],

      '5' => [
            '18' => '人事',
            '19' => '総務・労務',
            '20' => '広報・ＩＲ'
      ],

      '6' => [
            '21' => '法務',
            '22' => '特許・コンプライアンス'
      ]
    ],

    //スキル名
    'skill_name' => [
      '1' => [
            '1'  => 'Windows',
            '2'  => 'MacOS',
            '3'  => 'Linux',
            '4'  => 'AIX',
            '5'  => 'HP-UX',
            '6'  => 'Solaris',
            '7'  => 'BSD'
      ],
      '2' => [
            '8'  => 'Processing',
            '9'  => 'Pascal',
            '10'  => 'Kotlin',
            '11'  => 'LISP',
            '12'  => 'Lua',
            '13'  => 'Haskell',
            '14'  => 'Groovy',
            '15'  => 'FORTRAN',
            '16'  => 'Elixir',
            '17'  => 'BASIC',
            '18'  => 'Mathematica',
            '19'  => 'Bash',
            '20'  => 'Hack',
            '21'  => 'MATLAB',
            '22'  => 'VBScript',
            '23'  => 'Erlang',
            '24'  => 'Clojure',
            '25'  => 'F#',
            '26'  => 'Rust',
            '27'  => 'ES6',
            '28'  => 'PowerShell',
            '29'  => 'TypeScript',
            '30'  => 'Smalltalk',
            '31'  => 'ActionScript',
            '32'  => 'C',
            '33'  => 'C++',
            '34'  => 'Objective-C',
            '35'  => 'shell(C・B・K)',
            '36'  => 'JavaScript',
            '37'  => 'VBA',
            '38'  => 'VisualBasic',
            '39'  => 'VisualC',
            '40'  => 'VisualC++',
            '41'  => 'VisualJ#',
            '42'  => 'Visual Basic .NET',
            '43'  => 'Visual C# .NET',
            '44'  => 'Visual C++ .NET',
            '45'  => 'Visual J# .NET',
            '46'  => 'ASP.NET',
            '47'  => 'Delphi',
            '48'  => 'SQL',
            '49'  => 'Perl',
            '50'  => 'PHP',
            '51'  => 'Ruby',
            '52'  => 'Coldfusion',
            '53'  => 'Java',
            '54'  => 'J2EE・J2SE・J2ME',
            '55'  => 'JSP',
            '56'  => 'EJB・JavaBeans',
            '57'  => 'XML',
            '58'  => 'Flash',
            '59'  => 'ABAP/4',
            '60'  => 'COBOL',
            '61'  => 'PL/1',
            '62'  => 'RPG',
            '63'  => 'アセンブラ',
            '64'  => 'Python',
            '65'  => 'Swift',
            '66'  => 'Scala',
            '67'  => 'Go',
            '68'  => 'R',
            '69'  => 'Dart',
            '70'  => 'C#'
      ],
      '3' => [
            '71'  => 'Oracle',
            '72'  => 'DB2',
            '73'  => 'Sybase',
            '74'  => 'SQLServer',
            '75'  => 'Access',
            '76'  => 'Notes・Domino',
            '77'  => 'Exchange',
            '78'  => 'MySQL',
            '79'  => 'PostgreSQL'
      ],
      '4' => [
            '80'  => 'iOS開発',
            '81'  => 'Android開発',
            '82'  => 'Git',
            '83'  => 'Jenkins',
            '84'  => 'CircleCI',
            '85'  => 'TravisCI',
            '86'  => 'Chef',
            '87'  => 'Ansible',
            '88'  => 'Docker',
            '89'  => 'Kubernetes',
            '90'  => 'Vagrant',
            '91'  => 'VertualBox',
            '92'  => 'Grunt',
            '93'  => 'Gulp',
            '94'  => 'Webpack',
            '95'  => 'Babel',
            '96'  => 'npm-scripts',
            '97'  => 'Rollup',
            '98'  => 'Parcel',
            '99'  => 'gRPC',
            '100'  => 'Terraform',
            '101'  => 'SRE',
            '102'  => 'DevOps'
      ],
      '5' => [
            '103'  => 'Apache Spark',
            '104'  => 'Spring',
            '105'  => 'CodeIgniter',
            '106'  => 'Zend Framework',
            '107'  => 'Riot.js',
            '108'  => 'Symfony',
            '109'  => 'Play Framework',
            '110'  => 'Struts',
            '111'  => 'Struts2',
            '112'  => 'Seasar',
            '113'  => 'Slim3',
            '114'  => 'Symfony',
            '115'  => 'CakePHP',
            '116'  => 'CodeIgniter',
            '117'  => 'Zend Framework',
            '118'  => 'FuelPHP',
            '119'  => 'Ruby on Rails',
            '120'  => 'Sinatra',
            '121'  => 'Catalyst',
            '122'  => 'Mojolicious',
            '123'  => 'Django',
            '124'  => 'CoffeeScript',
            '125'  => 'jQuery',
            '126'  => 'Backborn.js',
            '127'  => 'Node.js',
            '128'  => 'cocos2d-x',
            '129'  => 'Unity',
            '130'  => 'UnrealEngine',
            '131'  => 'Corona',
            '132'  => 'PhoneGap',
            '133'  => 'Titanium Mobile',
            '134'  => 'jQuery Mobile',
            '135'  => 'jQTouch',
            '136'  => 'React',
            '137'  => 'AngularJS',
            '138'  => 'Hadoop',
            '139'  => 'Xamarin',
            '140'  => 'React Native',
            '141'  => 'Laravel',
            '142'  => 'vue.js',
            '143'  => 'Redux',
            '144'  => 'Electron',
            '145'  => 'Flux',
            '146'  => 'Nuxt.js',
            '147'  => 'Next.js',
            '148'  => 'Flutter',
            '149'  => 'bottle',
            '150'  => 'Flask'
      ],
      '6' => [
            '151'  => 'オンプレミス',
            '152'  => 'AWS',
            '153'  => 'GCP',
            '154'  => 'Azure'
      ],
      '7' => [
            '155'  => 'Chainer',
            '156'  => 'TensorFlow',
            '157'  => 'Keras',
            '158'  => 'scikit-learn',
            '159'  => 'StatsModel',
            '160'  => 'PyTorch',
            '161'  => 'Anaconda',
            '162'  => 'Caffe',
            '163'  => 'Tableau',
            '164'  => 'Jupyter'
      ],
      '8' => [
            '165'  => 'Photoshop',
            '166'  => 'Illustrator',
            '167'  => 'DreamWeaver',
            '168'  => 'FireWorks',
            '169'  => 'Flash',
            '170'  => 'Director',
            '171'  => 'QuarkXpress',
            '172'  => 'InDesign',
            '173'  => 'CAD',
            '174'  => '3DCG',
            '175'  => 'Sketch',
            '176'  => 'Adobe AfterEffects',
            '177'  => 'Premiere Pro',
            '178'  => 'Final Cut Pro',
            '179'  => 'Prott',
            '180'  => 'inVision',
            '181'  => 'Adobe XD',
            '182'  => 'Abstract',
            '183'  => 'Figma'
      ],
      '9' => [
            '184'  => 'HTML5',
            '185'  => 'CSS',
            '186'  => 'Sass',
            '187'  => 'UXデザイン',
            '188'  => 'サウンドクリエイト',
            '189'  => 'グラフィックデザイン',
            '190'  => 'インフォグラフィック',
            '191'  => 'コンセプトデザイン',
            '192'  => 'キャラクターデザイン',
            '193'  => 'UIデザイン',
            '194'  => '背景デザイン',
            '195'  => 'モンスターデザイン',
            '196'  => 'エフェクトデザイン'
      ],
      '10' => [
            '197'  => 'Spine',
            '198'  => 'SpriteStudio',
            '199'  => 'Live2d',
            '200'  => 'Anima2D'
      ],
      '11' => [
            '201'  => 'Maya',
            '202'  => 'Blender',
            '203'  => 'Metasequoia',
            '204'  => 'ZBrush',
            '205'  => '3ds Max'
      ],
      '12' => [
            '206'  => 'SPARK GEAR',
            '207'  => 'BISHAMON',
            '208'  => 'Shuriken',
            '209'  => 'Cascade'
      ],
      '13' => [
            '210'  => '新規開拓（アウトバウンド）',
            '211'  => '新規開拓（インバウンド）',
            '212'  => '営業資料・ツール作成'
      ],
      '14' => [
            '213'  => '市場調査・競合分析',
            '214'  => 'Webサイト・アプリ分析',
            '215'  => 'オンライン広告運用',
            '216'  => 'ECサイト運営'
      ],
      '15' => [
            '217'  => '新規事業企画・ビジネスモデル策定',
            '218'  => '事業計画・戦略立案',
            '219'  => '予算計画策定・予実管理',
            '220'  => '事業推進・損益管理',
            '221'  => '企業買収・提携実務'
      ],
      '16' => [
            '222'  => '伝票処理・入出金管理',
            '223'  => '外貨取引関連実務',
            '224'  => '与信管理',
            '225'  => '債権管理（売掛金・買掛金）',
            '226'  => '原価計算関連実務',
            '227'  => '固定資産管理',
            '228'  => '決算関連実務（月次・四半期・半期・年次）',
            '229'  => '連結決算関連実務（四半期・半期・年次）',
            '230'  => '会社法計算書類作成実務',
            '231'  => '有価証券報告書作成実務',
            '232'  => '監査対応',
            '233'  => '株式公開実務'
      ],
      '17' => [
            '234'  => '資金計画',
            '235'  => '資金調達管理',
            '236'  => '投資運用管理',
            '237'  => '税務申告書作成実務',
            '238'  => '連結納税関連実務',
            '239'  => '税務調査対応'
      ],
      '18' => [
            '240'  => '人員計画の立案',
            '241'  => '人事制度の立案',
            '242'  => '採用実務'
      ],
      '19' => [
            '243'  => '給与計算',
            '244'  => '労務管理',
            '245'  => '危機管理',
            '246'  => '契約書ほか各種文書のチェック・作成・管理',
            '247'  => '取締役会・株主総会運営',
            '248'  => 'オフィス・レイアウト関連',
            '249'  => '株式事務（ストックオプション・持株会等）'
      ],
      '20' => [
            '250'  => '社内広報',
            '251'  => 'プレスリリース作成',
            '252'  => '媒体プロモート',
            '253'  => '記者発表会企画・運営',
            '254'  => '株主・投資家対応',
            '255'  => '外部機関対応',
            '256'  => 'アニュアルレポート作成実務'
      ],
      '21' => [
            '257'  => '総会関連業務',
            '258'  => '契約関連業務',
            '259'  => 'M&amp;A・合併・提携'
      ],
      '22' => [
            '260'  => '個人情報保護',
            '261'  => '訴訟対応',
            '262'  => '外部折衝（官公庁・弁護士等）',
            '263'  => '国内特許関連実務',
            '264'  => '国外特許関連実務'
      ]
],

    //経験年数
    'experience_year' => [
'1' => '経験有り',
'2' => '１年以上',
'3' => '２年以上',
'4' => '３年以上',
'5' => '４年以上',
'6' => '５年以上',
'7' => '７年以上',
'8' => '10年以上',
'9' => '15年以上' 
    ],

    //担当工程
    'responsible_process' => [
        '1' => '企画',
        '2' => '要件定義',
        '3' => '基本設計',
        '4' => '詳細設計',
        '5' => '実装',
        '6' => 'テスト',
        '7' => '運用・保守',
        '8' => 'デザイン',
        '9' => 'コンサル',
        '10' => 'ディレクション',
        '11' => 'マネジメント',
        '12' => 'データ分析'
    ],


    // 選考フロー(業務委託)
    'selection_flows_project' => [
        '1' => '提案',
        '2' => '書類確認',
        '3' => '書類選考',
        '4' => '筆記・webテスト',
        '5' => '一次面談',
        '6' => '二次面談',
        '7' => '三次面談',
        '8' => '最終面接',
        '9' => '契約',
        '10' => '参画情報',
        '11' => '現状'
    ],

    // 選考フロー
    'selection_flows' => [
        '1' => '応募',
        '2' => '書類確認',
        '3' => '書類選考',
        '4' => '筆記・webテスト',
        '5' => '面談',
        '6' => '一次面談',
        '7' => '二次面談',
        '8' => '三次面談',
        '9' => '四次面談',
        '10' => '五次面談',
        '11' => '最終面接',
        '12' => '採用',
        '13' => '入社確認'
    ],

    // 年間採用人数
    'annual_recruit_numbers' => [
        1 => '～10人',
        2 => '11～50人',
        3 => '51～100人',
        4 => '101～1000人',
        5 => '1001～10000人',
        6 => '10001人以上'
    ],

    // 従業員数
    'employee_numbers' => [
        1 => '1～9人',
        2 => '10～49人',
        3 => '50～99人',
        4 => '100～999人',
        5 => '1000人～'
    ],

    // ご検討状況
    'consideration_statuses' => [
        1 => '近々導入したい',
        2 => '興味があり検討したい',
        3 => 'まずは話を聞きたい',
        4 => 'とりあえず資料を見たい'
    ],

    // 会社ステータス
    'company_statuses' => [
        1 => '問い合わせ求人企業',
        2 => '承認待ち求人企業',
        3 => '求人企業',
        4 => '承認不可求人企業',
        5 => '退会',
        6 => '強制アカウント停止'
    ],

    // 運営企業・権限
    'admin_roles' => [
        1 => 'スタッフ',
        2 => '管理者'
    ],

    // 会社問い合わせタイプ
    'company_contact_types' => [
        1 => 'お問い合わせ',
        2 => '資料請求（無料）'
    ],

    // メールアドレス
    'emails' => [
        'admin' => 'admin@incul-agent.jp'
    ],

    // ユーザータイプ
    'user_types' => [
        1 => '求人企業',
        2 => '人材紹介',
        3 => '業務委託SES',
        4 => '運営企業',
    ]
];
